//: [Previous](@previous)

import Foundation

//Создать dictionary, где ключ представлен названием месяца (создать enum с названиями месяцев и rawValue типа Int), а значение - количеством дней в нём. Заполнить его месяцами НЕ в хронологическом порядке.
//- выведите количество дней в каждом месяце (без имен месяцев)
//- отсортируйте месяцы по возрастанию количества дней и выведите названия месяцев
//- сгруппируйте месяцы по количеству дней и выведите в консоль
//- выведите названия месяцев в хронологическом порядке, отсортировав словарь по rawValue ключа
//- для произвольно выбранной даты (месяц и день) посчитайте количество дней до этой даты от начала года

//: [Next](@next)
